#include <stdio.h>
#include <iostream.h>
int main(){
	int a = 13;
	char c = 'A';
	char str[] = "jinhehui";
	char * b;
	printf("%4d,%c\n",a,c);//虏禄鹿禄4脦禄脫脪露脭脝毛
	printf("%x\n",c);//脢盲鲁枚脳脰路没碌脛ASCII脗毛脰碌
	printf("str=%4.7s\n",str);//脢盲鲁枚脢媒脳茅脳脰路没麓庐拢卢脳卯露脿脢盲鲁枚7赂枚
	printf("s = %p\n",str);//脢盲鲁枚脳脰路没麓庐脢脳碌脴脰路0018FF34
	//b=&0018FF34;//脰赂脮毛鲁玫脢录禄炉脢卤拢卢隆掳=隆卤碌脛脫脪虏脵脳梅脢媒卤脴脨毛脦陋脛脷麓忙脰脨脢媒戮脻碌脛碌脴脰路拢卢虏禄驴脡脪脭脢脟卤盲脕驴拢卢脪虏虏禄驴脡脪脭脰卤陆脫脫脙脮没脨脥碌脴脰路脰碌(碌芦脢脟int*p=0;鲁媒脥芒拢卢赂脙脫茂戮盲卤铆脢戮脰赂脮毛脦陋驴脮)隆拢
	printf("b=%p\n",*b);

	int k;
	int *p;
	p=&k;//掳脩麓忙麓垄卤盲脕驴K碌脛碌脴脰路赂鲁赂酶脰赂脮毛卤盲脕驴麓忙麓垄
	*p = 6;//*p脰赂脧貌碌脛脢脟卤盲脕驴k拢卢驴脡驴麓脳枚脢脟碌脠脥卢脫脷卤盲脕驴k拢卢脣霉脫脨卤盲脕驴k碌脛脰碌脦陋6
	printf("k=%p\n",p);
	return 0;
}